jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SARADC_A_Registers.h
//------------------------------------------------------------------------------
// Copyright (c) 2012 by Silicon Laboratories. 
// All rights reserved. This program and the accompanying materials
// are made available under the terms of the Silicon Laboratories End User 
// License Agreement which accompanies this distribution, and is available at
// http://developer.silabs.com/legal/version/v10/License_Agreement_v10.htm
// Original content and implementation provided by Silicon Laboratories.
//------------------------------------------------------------------------------
//
// Script: 0.57
// Version: 1

#ifndef __SI32_SARADC_A_REGISTERS_H__
#define __SI32_SARADC_A_REGISTERS_H__

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

struct SI32_SARADC_A_CONFIG_Struct
{
   union
   {
      struct
      {
         // Sampling Phase Select
         volatile uint32_t SPSEL: 4;
         // Sampling Phase Enable
         volatile uint32_t SPEN: 1;
         // Synchronous Sample Generator Enable
         volatile uint32_t SSGEN: 1;
         // Output Packing Mode
         volatile uint32_t PACKMD: 2;
         // Simultaneous Conversion Packing Enable
         volatile uint32_t SIMCEN: 1;
         // Interleaved Conversion Packing Enable
         volatile uint32_t INTLVEN: 1;
         // Scan Mode Enable
         volatile uint32_t SCANEN: 1;
                  uint32_t reserved0: 1;
         // Scan Mode Select
         volatile uint32_t SCANMD: 1;
                  uint32_t reserved1: 1;
         // DMA Interface Enable
         volatile uint32_t DMAEN: 1;
         // Burst Mode Clock Select
         volatile uint32_t BCLKSEL: 1;
         // SAR Clock Divider
         volatile uint32_t CLKDIV: 11;
         // Single Conversion Complete Interrupt Enable
         volatile uint32_t SCCIEN: 1;
         // Scan Done Interrupt Enable
         volatile uint32_t SDIEN: 1;
         // FIFO Overrun Interrupt Enable
         volatile uint32_t FORIEN: 1;
         // FIFO Underrun Interrupt Enable
         volatile uint32_t FURIEN: 1;
                  uint32_t reserved2: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SARADC_A_CONFIG_SPSEL_MASK  0x0000000F
#define SI32_SARADC_A_CONFIG_SPSEL_SHIFT  0
// The ADC samples at SSG phase 0.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE0_VALUE  0
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE0_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE0_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 1.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE1_VALUE  1
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE1_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE1_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 2.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE2_VALUE  2
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE2_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE2_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 3.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE3_VALUE  3
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE3_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE3_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 4.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE4_VALUE  4
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE4_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE4_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 5.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE5_VALUE  5
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE5_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE5_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 6.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE6_VALUE  6
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE6_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE6_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 7.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE7_VALUE  7
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE7_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE7_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 8.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE8_VALUE  8
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE8_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE8_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 9.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE9_VALUE  9
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE9_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE9_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 10.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE10_VALUE  10
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE10_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE10_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 11.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE11_VALUE  11
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE11_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE11_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 12.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE12_VALUE  12
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE12_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE12_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 13.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE13_VALUE  13
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE13_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE13_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 14.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE14_VALUE  14
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE14_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE14_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)
// The ADC samples at SSG phase 15.
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE15_VALUE  15
#define SI32_SARADC_A_CONFIG_SPSEL_PHASE15_U32 \
   (SI32_SARADC_A_CONFIG_SPSEL_PHASE15_VALUE << SI32_SARADC_A_CONFIG_SPSEL_SHIFT)

#define SI32_SARADC_A_CONFIG_SPEN_MASK  0x00000010
#define SI32_SARADC_A_CONFIG_SPEN_SHIFT  4
// Disable Phase Select.  The ADC will always sample on the start-of-conversion
// trigger selected by the SCSEL field.
#define SI32_SARADC_A_CONFIG_SPEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONFIG_SPEN_DISABLED_U32 \
   (SI32_SARADC_A_CONFIG_SPEN_DISABLED_VALUE << SI32_SARADC_A_CONFIG_SPEN_SHIFT)
// Enable Phase Select.  The ADC will sample according to the phase selected by the
// SPSEL field.
#define SI32_SARADC_A_CONFIG_SPEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONFIG_SPEN_ENABLED_U32 \
   (SI32_SARADC_A_CONFIG_SPEN_ENABLED_VALUE << SI32_SARADC_A_CONFIG_SPEN_SHIFT)

#define SI32_SARADC_A_CONFIG_SSGEN_MASK  0x00000020
#define SI32_SARADC_A_CONFIG_SSGEN_SHIFT  5
// Disable the SAR clock output to SSG.
#define SI32_SARADC_A_CONFIG_SSGEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONFIG_SSGEN_DISABLED_U32 \
   (SI32_SARADC_A_CONFIG_SSGEN_DISABLED_VALUE << SI32_SARADC_A_CONFIG_SSGEN_SHIFT)
// The ADC is the SSG master, and the SAR clock will be output to the SSG block.
#define SI32_SARADC_A_CONFIG_SSGEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONFIG_SSGEN_ENABLED_U32 \
   (SI32_SARADC_A_CONFIG_SSGEN_ENABLED_VALUE << SI32_SARADC_A_CONFIG_SSGEN_SHIFT)

