jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SARADC_A_Registers.h
#define SI32_SARADC_A_CONFIG_PACKMD_MASK  0x000000C0
#define SI32_SARADC_A_CONFIG_PACKMD_SHIFT  6
// Data is written to the upper half-word and the lower half-word is filled with
// 0's.  An SCI interrupt is triggered when data is written, if enabled.
#define SI32_SARADC_A_CONFIG_PACKMD_UPPER_ONLY_VALUE  0
#define SI32_SARADC_A_CONFIG_PACKMD_UPPER_ONLY_U32 \
   (SI32_SARADC_A_CONFIG_PACKMD_UPPER_ONLY_VALUE << SI32_SARADC_A_CONFIG_PACKMD_SHIFT)
// Data is written to the lower half-word, and the upper half-word is filled with
// 0's. An SCI interrupt is triggered when data is written, if enabled.
#define SI32_SARADC_A_CONFIG_PACKMD_LOWER_ONLY_VALUE  1
#define SI32_SARADC_A_CONFIG_PACKMD_LOWER_ONLY_U32 \
   (SI32_SARADC_A_CONFIG_PACKMD_LOWER_ONLY_VALUE << SI32_SARADC_A_CONFIG_PACKMD_SHIFT)
// Two data words are packed into the register with the upper half-word
// representing the earlier data, and the lower half-word representing the later
// data.  If SIMCEN is set to 1, the upper half-word represents data from the
// master ADC (selected by SSGEN) and the lower half-word represents data from the
// slave ADC. The ADC write to the lower half-word will trigger the SCI interrupt,
// if enabled.
#define SI32_SARADC_A_CONFIG_PACKMD_UPPER_FIRST_VALUE  2
#define SI32_SARADC_A_CONFIG_PACKMD_UPPER_FIRST_U32 \
   (SI32_SARADC_A_CONFIG_PACKMD_UPPER_FIRST_VALUE << SI32_SARADC_A_CONFIG_PACKMD_SHIFT)
// Two data words are packed into the register with the lower half-word
// representing the earlier data, and the upper half-word representing the later
// data.  If SIMCEN is set to 1, the lower half-word represents data from the
// master ADC (selected by SSGEN) and the upper half-word represents data from the
// slave ADC. The ADC write to the upper half-word will trigger the SCI interrupt,
// if enabled.
#define SI32_SARADC_A_CONFIG_PACKMD_LOWER_FIRST_VALUE  3
#define SI32_SARADC_A_CONFIG_PACKMD_LOWER_FIRST_U32 \
   (SI32_SARADC_A_CONFIG_PACKMD_LOWER_FIRST_VALUE << SI32_SARADC_A_CONFIG_PACKMD_SHIFT)

#define SI32_SARADC_A_CONFIG_SIMCEN_MASK  0x00000100
#define SI32_SARADC_A_CONFIG_SIMCEN_SHIFT  8
// Disable simultaneous mode conversion packing.
#define SI32_SARADC_A_CONFIG_SIMCEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONFIG_SIMCEN_DISABLED_U32 \
   (SI32_SARADC_A_CONFIG_SIMCEN_DISABLED_VALUE << SI32_SARADC_A_CONFIG_SIMCEN_SHIFT)
// Enable simultaneous mode conversion packing.
#define SI32_SARADC_A_CONFIG_SIMCEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONFIG_SIMCEN_ENABLED_U32 \
   (SI32_SARADC_A_CONFIG_SIMCEN_ENABLED_VALUE << SI32_SARADC_A_CONFIG_SIMCEN_SHIFT)

#define SI32_SARADC_A_CONFIG_INTLVEN_MASK  0x00000200
#define SI32_SARADC_A_CONFIG_INTLVEN_SHIFT  9
// Disable interleaved mode conversion packing.
#define SI32_SARADC_A_CONFIG_INTLVEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONFIG_INTLVEN_DISABLED_U32 \
   (SI32_SARADC_A_CONFIG_INTLVEN_DISABLED_VALUE << SI32_SARADC_A_CONFIG_INTLVEN_SHIFT)
// Enable interleaved mode conversion packing.
#define SI32_SARADC_A_CONFIG_INTLVEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONFIG_INTLVEN_ENABLED_U32 \
   (SI32_SARADC_A_CONFIG_INTLVEN_ENABLED_VALUE << SI32_SARADC_A_CONFIG_INTLVEN_SHIFT)

#define SI32_SARADC_A_CONFIG_SCANEN_MASK  0x00000400
#define SI32_SARADC_A_CONFIG_SCANEN_SHIFT  10
// Disable ADC scan mode.
#define SI32_SARADC_A_CONFIG_SCANEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONFIG_SCANEN_DISABLED_U32 \
   (SI32_SARADC_A_CONFIG_SCANEN_DISABLED_VALUE << SI32_SARADC_A_CONFIG_SCANEN_SHIFT)
// Enable ADC scan mode. The ADC will scan through the defined time slots in
// sequence on every start of conversion.
#define SI32_SARADC_A_CONFIG_SCANEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONFIG_SCANEN_ENABLED_U32 \
   (SI32_SARADC_A_CONFIG_SCANEN_ENABLED_VALUE << SI32_SARADC_A_CONFIG_SCANEN_SHIFT)

#define SI32_SARADC_A_CONFIG_SCANMD_MASK  0x00001000
#define SI32_SARADC_A_CONFIG_SCANMD_SHIFT  12
// The channel sequencer will cycle through all of the specified time slots once.
#define SI32_SARADC_A_CONFIG_SCANMD_ONCE_VALUE  0
#define SI32_SARADC_A_CONFIG_SCANMD_ONCE_U32 \
   (SI32_SARADC_A_CONFIG_SCANMD_ONCE_VALUE << SI32_SARADC_A_CONFIG_SCANMD_SHIFT)
// The channel sequencer will cycle through all of the specified time slots in a
// loop until SCANEN is cleared to 0.
#define SI32_SARADC_A_CONFIG_SCANMD_LOOP_VALUE  1
#define SI32_SARADC_A_CONFIG_SCANMD_LOOP_U32 \
   (SI32_SARADC_A_CONFIG_SCANMD_LOOP_VALUE << SI32_SARADC_A_CONFIG_SCANMD_SHIFT)

#define SI32_SARADC_A_CONFIG_DMAEN_MASK  0x00004000
#define SI32_SARADC_A_CONFIG_DMAEN_SHIFT  14
// Disable the ADC module DMA interface.
#define SI32_SARADC_A_CONFIG_DMAEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONFIG_DMAEN_DISABLED_U32 \
   (SI32_SARADC_A_CONFIG_DMAEN_DISABLED_VALUE << SI32_SARADC_A_CONFIG_DMAEN_SHIFT)
// Enable the ADC module DMA interface.
#define SI32_SARADC_A_CONFIG_DMAEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONFIG_DMAEN_ENABLED_U32 \
   (SI32_SARADC_A_CONFIG_DMAEN_ENABLED_VALUE << SI32_SARADC_A_CONFIG_DMAEN_SHIFT)

#define SI32_SARADC_A_CONFIG_BCLKSEL_MASK  0x00008000
#define SI32_SARADC_A_CONFIG_BCLKSEL_SHIFT  15
// Burst mode uses the Low Power Oscillator.
#define SI32_SARADC_A_CONFIG_BCLKSEL_LPOSC0_VALUE  0
#define SI32_SARADC_A_CONFIG_BCLKSEL_LPOSC0_U32 \
   (SI32_SARADC_A_CONFIG_BCLKSEL_LPOSC0_VALUE << SI32_SARADC_A_CONFIG_BCLKSEL_SHIFT)
// Burst mode uses the APB clock.
#define SI32_SARADC_A_CONFIG_BCLKSEL_APB_VALUE  1
#define SI32_SARADC_A_CONFIG_BCLKSEL_APB_U32 \
   (SI32_SARADC_A_CONFIG_BCLKSEL_APB_VALUE << SI32_SARADC_A_CONFIG_BCLKSEL_SHIFT)

#define SI32_SARADC_A_CONFIG_CLKDIV_MASK  0x07FF0000
#define SI32_SARADC_A_CONFIG_CLKDIV_SHIFT  16

#define SI32_SARADC_A_CONFIG_SCCIEN_MASK  0x08000000
#define SI32_SARADC_A_CONFIG_SCCIEN_SHIFT  27
// Disable the ADC single data conversion complete interrupt.
#define SI32_SARADC_A_CONFIG_SCCIEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONFIG_SCCIEN_DISABLED_U32 \
   (SI32_SARADC_A_CONFIG_SCCIEN_DISABLED_VALUE << SI32_SARADC_A_CONFIG_SCCIEN_SHIFT)
// Enable the ADC single data conversion complete interrupt.
#define SI32_SARADC_A_CONFIG_SCCIEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONFIG_SCCIEN_ENABLED_U32 \
   (SI32_SARADC_A_CONFIG_SCCIEN_ENABLED_VALUE << SI32_SARADC_A_CONFIG_SCCIEN_SHIFT)

