jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SARADC_A_Registers.h
#define SI32_SARADC_A_CONFIG_SDIEN_MASK  0x10000000
#define SI32_SARADC_A_CONFIG_SDIEN_SHIFT  28
// Disable the ADC scan complete interrupt.
#define SI32_SARADC_A_CONFIG_SDIEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONFIG_SDIEN_DISABLED_U32 \
   (SI32_SARADC_A_CONFIG_SDIEN_DISABLED_VALUE << SI32_SARADC_A_CONFIG_SDIEN_SHIFT)
// Enable the ADC scan complete interrupt.
#define SI32_SARADC_A_CONFIG_SDIEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONFIG_SDIEN_ENABLED_U32 \
   (SI32_SARADC_A_CONFIG_SDIEN_ENABLED_VALUE << SI32_SARADC_A_CONFIG_SDIEN_SHIFT)

#define SI32_SARADC_A_CONFIG_FORIEN_MASK  0x20000000
#define SI32_SARADC_A_CONFIG_FORIEN_SHIFT  29
// Disable the data FIFO overrun interrupt.
#define SI32_SARADC_A_CONFIG_FORIEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONFIG_FORIEN_DISABLED_U32 \
   (SI32_SARADC_A_CONFIG_FORIEN_DISABLED_VALUE << SI32_SARADC_A_CONFIG_FORIEN_SHIFT)
// Enable the data FIFO overrun interrupt.
#define SI32_SARADC_A_CONFIG_FORIEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONFIG_FORIEN_ENABLED_U32 \
   (SI32_SARADC_A_CONFIG_FORIEN_ENABLED_VALUE << SI32_SARADC_A_CONFIG_FORIEN_SHIFT)

#define SI32_SARADC_A_CONFIG_FURIEN_MASK  0x40000000
#define SI32_SARADC_A_CONFIG_FURIEN_SHIFT  30
// Disable the data FIFO underrun interrupt.
#define SI32_SARADC_A_CONFIG_FURIEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONFIG_FURIEN_DISABLED_U32 \
   (SI32_SARADC_A_CONFIG_FURIEN_DISABLED_VALUE << SI32_SARADC_A_CONFIG_FURIEN_SHIFT)
// Enable the data FIFO underrun interrupt.
#define SI32_SARADC_A_CONFIG_FURIEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONFIG_FURIEN_ENABLED_U32 \
   (SI32_SARADC_A_CONFIG_FURIEN_ENABLED_VALUE << SI32_SARADC_A_CONFIG_FURIEN_SHIFT)



struct SI32_SARADC_A_CONTROL_Struct
{
   union
   {
      struct
      {
         // Reference Ground Select
         volatile uint32_t REFGNDSEL: 1;
         // Sampling Clock Edge Select
         volatile uint32_t CLKESEL: 1;
         // Burst Mode Tracking Time
         volatile uint32_t BMTK: 6;
         // Start-Of-Conversion Source Select
         volatile uint32_t SCSEL: 4;
         // Burst Mode Power Up Time
         volatile uint32_t PWRTIME: 4;
         // Burst Mode Enable
         volatile uint32_t BURSTEN: 1;
         // ADC Enable
         volatile uint32_t ADCEN: 1;
         // 12-Bit Mode Sample Select
         volatile uint32_t AD12BSSEL: 1;
         // Common Mode Buffer Enable
         volatile uint32_t VCMEN: 1;
                  uint32_t reserved0: 1;
         // Accumulation Mode
         volatile uint32_t ACCMD: 1;
         // ADC Tracking Mode
         volatile uint32_t TRKMD: 1;
         // ADC Busy
         volatile uint32_t ADBUSY: 1;
         // Bias Power Select
         volatile uint32_t BIASSEL: 2;
         // Low Power Mode Enable
         volatile uint32_t LPMDEN: 1;
         // MUX and VREF Low Power Enable
         volatile uint32_t MREFLPEN: 1;
                  uint32_t reserved1: 2;
         // Voltage Reference Select
         volatile uint32_t VREFSEL: 2;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SARADC_A_CONTROL_REFGNDSEL_MASK  0x00000001
#define SI32_SARADC_A_CONTROL_REFGNDSEL_SHIFT  0
// The internal device ground is used as the ground reference for ADC conversions.
#define SI32_SARADC_A_CONTROL_REFGNDSEL_INTERNAL_VALUE  0
#define SI32_SARADC_A_CONTROL_REFGNDSEL_INTERNAL_U32 \
   (SI32_SARADC_A_CONTROL_REFGNDSEL_INTERNAL_VALUE << SI32_SARADC_A_CONTROL_REFGNDSEL_SHIFT)
// The VREFGND pin is used as the ground reference for ADC conversions.
#define SI32_SARADC_A_CONTROL_REFGNDSEL_EXTERNAL_VALUE  1
#define SI32_SARADC_A_CONTROL_REFGNDSEL_EXTERNAL_U32 \
   (SI32_SARADC_A_CONTROL_REFGNDSEL_EXTERNAL_VALUE << SI32_SARADC_A_CONTROL_REFGNDSEL_SHIFT)

#define SI32_SARADC_A_CONTROL_CLKESEL_MASK  0x00000002
#define SI32_SARADC_A_CONTROL_CLKESEL_SHIFT  1
// Select the rising edge of the APB clock.
#define SI32_SARADC_A_CONTROL_CLKESEL_RISING_VALUE  0
#define SI32_SARADC_A_CONTROL_CLKESEL_RISING_U32 \
   (SI32_SARADC_A_CONTROL_CLKESEL_RISING_VALUE << SI32_SARADC_A_CONTROL_CLKESEL_SHIFT)
// Select the falling edge of the APB clock.
#define SI32_SARADC_A_CONTROL_CLKESEL_FALLING_VALUE  1
#define SI32_SARADC_A_CONTROL_CLKESEL_FALLING_U32 \
   (SI32_SARADC_A_CONTROL_CLKESEL_FALLING_VALUE << SI32_SARADC_A_CONTROL_CLKESEL_SHIFT)

#define SI32_SARADC_A_CONTROL_BMTK_MASK  0x000000FC
#define SI32_SARADC_A_CONTROL_BMTK_SHIFT  2

#define SI32_SARADC_A_CONTROL_SCSEL_MASK  0x00000F00
#define SI32_SARADC_A_CONTROL_SCSEL_SHIFT  8
// An ADC conversion triggers from the ADCnT0 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT0_VALUE  0
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT0_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT0_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT1 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT1_VALUE  1
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT1_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT1_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT2 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT2_VALUE  2
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT2_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT2_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT3 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT3_VALUE  3
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT3_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT3_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT4 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT4_VALUE  4
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT4_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT4_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT5 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT5_VALUE  5
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT5_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT5_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT6 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT6_VALUE  6
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT6_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT6_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT7 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT7_VALUE  7
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT7_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT7_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT8 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT8_VALUE  8
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT8_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT8_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT9 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT9_VALUE  9
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT9_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT9_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT10 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT10_VALUE  10
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT10_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT10_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT11 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT11_VALUE  11
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT11_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT11_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT12 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT12_VALUE  12
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT12_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT12_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT13 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT13_VALUE  13
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT13_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT13_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT14 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT14_VALUE  14
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT14_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT14_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)
// An ADC conversion triggers from the ADCnT15 trigger source.
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT15_VALUE  15
#define SI32_SARADC_A_CONTROL_SCSEL_ADCNT15_U32 \
   (SI32_SARADC_A_CONTROL_SCSEL_ADCNT15_VALUE << SI32_SARADC_A_CONTROL_SCSEL_SHIFT)

#define SI32_SARADC_A_CONTROL_PWRTIME_MASK  0x0000F000
#define SI32_SARADC_A_CONTROL_PWRTIME_SHIFT  12

#define SI32_SARADC_A_CONTROL_BURSTEN_MASK  0x00010000
#define SI32_SARADC_A_CONTROL_BURSTEN_SHIFT  16
// Disable burst mode.
#define SI32_SARADC_A_CONTROL_BURSTEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONTROL_BURSTEN_DISABLED_U32 \
   (SI32_SARADC_A_CONTROL_BURSTEN_DISABLED_VALUE << SI32_SARADC_A_CONTROL_BURSTEN_SHIFT)
// Enable burst mode.
#define SI32_SARADC_A_CONTROL_BURSTEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONTROL_BURSTEN_ENABLED_U32 \
   (SI32_SARADC_A_CONTROL_BURSTEN_ENABLED_VALUE << SI32_SARADC_A_CONTROL_BURSTEN_SHIFT)

