jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SARADC_A_Registers.h
#define SI32_SARADC_A_CONTROL_ADCEN_MASK  0x00020000
#define SI32_SARADC_A_CONTROL_ADCEN_SHIFT  17
// Disable the ADC (low-power shutdown).
#define SI32_SARADC_A_CONTROL_ADCEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONTROL_ADCEN_DISABLED_U32 \
   (SI32_SARADC_A_CONTROL_ADCEN_DISABLED_VALUE << SI32_SARADC_A_CONTROL_ADCEN_SHIFT)
// Enable the ADC (active and ready for data conversions).
#define SI32_SARADC_A_CONTROL_ADCEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONTROL_ADCEN_ENABLED_U32 \
   (SI32_SARADC_A_CONTROL_ADCEN_ENABLED_VALUE << SI32_SARADC_A_CONTROL_ADCEN_SHIFT)

#define SI32_SARADC_A_CONTROL_AD12BSSEL_MASK  0x00040000
#define SI32_SARADC_A_CONTROL_AD12BSSEL_SHIFT  18
// The ADC re-samples the input before each of the four conversions.
#define SI32_SARADC_A_CONTROL_AD12BSSEL_FOUR_VALUE  0
#define SI32_SARADC_A_CONTROL_AD12BSSEL_FOUR_U32 \
   (SI32_SARADC_A_CONTROL_AD12BSSEL_FOUR_VALUE << SI32_SARADC_A_CONTROL_AD12BSSEL_SHIFT)
// The ADC samples once before the first conversion and converts four times.
#define SI32_SARADC_A_CONTROL_AD12BSSEL_ONE_VALUE  1
#define SI32_SARADC_A_CONTROL_AD12BSSEL_ONE_U32 \
   (SI32_SARADC_A_CONTROL_AD12BSSEL_ONE_VALUE << SI32_SARADC_A_CONTROL_AD12BSSEL_SHIFT)

#define SI32_SARADC_A_CONTROL_VCMEN_MASK  0x00080000
#define SI32_SARADC_A_CONTROL_VCMEN_SHIFT  19
// Disable the common mode buffer.
#define SI32_SARADC_A_CONTROL_VCMEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONTROL_VCMEN_DISABLED_U32 \
   (SI32_SARADC_A_CONTROL_VCMEN_DISABLED_VALUE << SI32_SARADC_A_CONTROL_VCMEN_SHIFT)
// Enable the common mode buffer.
#define SI32_SARADC_A_CONTROL_VCMEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONTROL_VCMEN_ENABLED_U32 \
   (SI32_SARADC_A_CONTROL_VCMEN_ENABLED_VALUE << SI32_SARADC_A_CONTROL_VCMEN_SHIFT)

#define SI32_SARADC_A_CONTROL_ACCMD_MASK  0x00200000
#define SI32_SARADC_A_CONTROL_ACCMD_SHIFT  21
// Conversions will be accumulated for the specified number of cycles in burst mode
// according to the channel configuration.
#define SI32_SARADC_A_CONTROL_ACCMD_ACCUMULATE_VALUE  0
#define SI32_SARADC_A_CONTROL_ACCMD_ACCUMULATE_U32 \
   (SI32_SARADC_A_CONTROL_ACCMD_ACCUMULATE_VALUE << SI32_SARADC_A_CONTROL_ACCMD_SHIFT)
// Conversions will not be accumulated in burst mode.
#define SI32_SARADC_A_CONTROL_ACCMD_REPEAT_VALUE  1
#define SI32_SARADC_A_CONTROL_ACCMD_REPEAT_U32 \
   (SI32_SARADC_A_CONTROL_ACCMD_REPEAT_VALUE << SI32_SARADC_A_CONTROL_ACCMD_SHIFT)

#define SI32_SARADC_A_CONTROL_TRKMD_MASK  0x00400000
#define SI32_SARADC_A_CONTROL_TRKMD_SHIFT  22
// Normal Tracking Mode: When the ADC is enabled, a conversion begins immediately
// following the start-of-conversion signal.
#define SI32_SARADC_A_CONTROL_TRKMD_NORMAL_VALUE  0
#define SI32_SARADC_A_CONTROL_TRKMD_NORMAL_U32 \
   (SI32_SARADC_A_CONTROL_TRKMD_NORMAL_VALUE << SI32_SARADC_A_CONTROL_TRKMD_SHIFT)
// Delayed Tracking Mode: When the ADC is enabled, a conversion begins 3 SAR clock
// cycles following the start-of-conversion signal. The ADC is allowed to track
// during this time.
#define SI32_SARADC_A_CONTROL_TRKMD_DELAYED_VALUE  1
#define SI32_SARADC_A_CONTROL_TRKMD_DELAYED_U32 \
   (SI32_SARADC_A_CONTROL_TRKMD_DELAYED_VALUE << SI32_SARADC_A_CONTROL_TRKMD_SHIFT)

#define SI32_SARADC_A_CONTROL_ADBUSY_MASK  0x00800000
#define SI32_SARADC_A_CONTROL_ADBUSY_SHIFT  23

#define SI32_SARADC_A_CONTROL_BIASSEL_MASK  0x03000000
#define SI32_SARADC_A_CONTROL_BIASSEL_SHIFT  24
// Select bias current mode 0. Recommended to use modes 1, 2, or 3.
#define SI32_SARADC_A_CONTROL_BIASSEL_MODE0_VALUE  0
#define SI32_SARADC_A_CONTROL_BIASSEL_MODE0_U32 \
   (SI32_SARADC_A_CONTROL_BIASSEL_MODE0_VALUE << SI32_SARADC_A_CONTROL_BIASSEL_SHIFT)
// Select bias current mode 1 (SARCLK = 16 MHz).
#define SI32_SARADC_A_CONTROL_BIASSEL_MODE1_VALUE  1
#define SI32_SARADC_A_CONTROL_BIASSEL_MODE1_U32 \
   (SI32_SARADC_A_CONTROL_BIASSEL_MODE1_VALUE << SI32_SARADC_A_CONTROL_BIASSEL_SHIFT)
// Select bias current mode 2.
#define SI32_SARADC_A_CONTROL_BIASSEL_MODE2_VALUE  2
#define SI32_SARADC_A_CONTROL_BIASSEL_MODE2_U32 \
   (SI32_SARADC_A_CONTROL_BIASSEL_MODE2_VALUE << SI32_SARADC_A_CONTROL_BIASSEL_SHIFT)
// Select bias current mode 3 (SARCLK = 4 MHz).
#define SI32_SARADC_A_CONTROL_BIASSEL_MODE3_VALUE  3
#define SI32_SARADC_A_CONTROL_BIASSEL_MODE3_U32 \
   (SI32_SARADC_A_CONTROL_BIASSEL_MODE3_VALUE << SI32_SARADC_A_CONTROL_BIASSEL_SHIFT)

#define SI32_SARADC_A_CONTROL_LPMDEN_MASK  0x04000000
#define SI32_SARADC_A_CONTROL_LPMDEN_SHIFT  26
// Disable low power mode.
#define SI32_SARADC_A_CONTROL_LPMDEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONTROL_LPMDEN_DISABLED_U32 \
   (SI32_SARADC_A_CONTROL_LPMDEN_DISABLED_VALUE << SI32_SARADC_A_CONTROL_LPMDEN_SHIFT)
// Enable low power mode (requires extended tracking time).
#define SI32_SARADC_A_CONTROL_LPMDEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONTROL_LPMDEN_ENABLED_U32 \
   (SI32_SARADC_A_CONTROL_LPMDEN_ENABLED_VALUE << SI32_SARADC_A_CONTROL_LPMDEN_SHIFT)

#define SI32_SARADC_A_CONTROL_MREFLPEN_MASK  0x08000000
#define SI32_SARADC_A_CONTROL_MREFLPEN_SHIFT  27
// Disable low power mode.
#define SI32_SARADC_A_CONTROL_MREFLPEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CONTROL_MREFLPEN_DISABLED_U32 \
   (SI32_SARADC_A_CONTROL_MREFLPEN_DISABLED_VALUE << SI32_SARADC_A_CONTROL_MREFLPEN_SHIFT)
// Enable low power mode (SAR clock <= 4 MHz).
#define SI32_SARADC_A_CONTROL_MREFLPEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CONTROL_MREFLPEN_ENABLED_U32 \
   (SI32_SARADC_A_CONTROL_MREFLPEN_ENABLED_VALUE << SI32_SARADC_A_CONTROL_MREFLPEN_SHIFT)

#define SI32_SARADC_A_CONTROL_VREFSEL_MASK  0xC0000000
#define SI32_SARADC_A_CONTROL_VREFSEL_SHIFT  30
// Select the internal, dedicated SARADC voltage reference as the ADC reference.
#define SI32_SARADC_A_CONTROL_VREFSEL_INTERNAL_VREF_VALUE  0U
#define SI32_SARADC_A_CONTROL_VREFSEL_INTERNAL_VREF_U32 \
   (SI32_SARADC_A_CONTROL_VREFSEL_INTERNAL_VREF_VALUE << SI32_SARADC_A_CONTROL_VREFSEL_SHIFT)
// Select the VDD pin as the ADC reference.
#define SI32_SARADC_A_CONTROL_VREFSEL_VDD_VALUE  1U
#define SI32_SARADC_A_CONTROL_VREFSEL_VDD_U32 \
   (SI32_SARADC_A_CONTROL_VREFSEL_VDD_VALUE << SI32_SARADC_A_CONTROL_VREFSEL_SHIFT)
// Select the output of the internal LDO regulator (~1.8 V) as the ADC reference.
#define SI32_SARADC_A_CONTROL_VREFSEL_LDO_OUT_VALUE  2U
#define SI32_SARADC_A_CONTROL_VREFSEL_LDO_OUT_U32 \
   (SI32_SARADC_A_CONTROL_VREFSEL_LDO_OUT_VALUE << SI32_SARADC_A_CONTROL_VREFSEL_SHIFT)
// Select the VREF pin as the ADC reference. This option is used for either an
// external VREF or the on-chip VREF driving out to the VREF pin.
#define SI32_SARADC_A_CONTROL_VREFSEL_EXTERNAL_VREF_VALUE  3U
#define SI32_SARADC_A_CONTROL_VREFSEL_EXTERNAL_VREF_U32 \
   (SI32_SARADC_A_CONTROL_VREFSEL_EXTERNAL_VREF_VALUE << SI32_SARADC_A_CONTROL_VREFSEL_SHIFT)



