jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SARADC_A_Registers.h
struct SI32_SARADC_A_SQ7654_Struct
{
   union
   {
      struct
      {
         // Time Slot 4 Conversion Characteristic
         volatile uint32_t TS4CHR: 2;
         // Time Slot 4 Input Channel
         volatile uint32_t TS4MUX: 5;
                  uint32_t reserved0: 1;
         // Time Slot 5 Conversion Characteristic
         volatile uint32_t TS5CHR: 2;
         // Time Slot 5 Input Channel
         volatile uint32_t TS5MUX: 5;
                  uint32_t reserved1: 1;
         // Time Slot 6 Conversion Characteristic
         volatile uint32_t TS6CHR: 2;
         // Time Slot 6 Input Channel
         volatile uint32_t TS6MUX: 5;
                  uint32_t reserved2: 1;
         // Time Slot 7 Conversion Characteristic
         volatile uint32_t TS7CHR: 2;
         // Time Slot 7 Input Channel
         volatile uint32_t TS7MUX: 5;
                  uint32_t reserved3: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SARADC_A_SQ7654_TS4CHR_MASK  0x00000003
#define SI32_SARADC_A_SQ7654_TS4CHR_SHIFT  0
// Select conversion characteristic 0 for time slot 4.
#define SI32_SARADC_A_SQ7654_TS4CHR_CC0_VALUE  0
#define SI32_SARADC_A_SQ7654_TS4CHR_CC0_U32 \
   (SI32_SARADC_A_SQ7654_TS4CHR_CC0_VALUE << SI32_SARADC_A_SQ7654_TS4CHR_SHIFT)
// Select conversion characteristic 1 for time slot 4.
#define SI32_SARADC_A_SQ7654_TS4CHR_CC1_VALUE  1
#define SI32_SARADC_A_SQ7654_TS4CHR_CC1_U32 \
   (SI32_SARADC_A_SQ7654_TS4CHR_CC1_VALUE << SI32_SARADC_A_SQ7654_TS4CHR_SHIFT)
// Select conversion characteristic 2 for time slot 4.
#define SI32_SARADC_A_SQ7654_TS4CHR_CC2_VALUE  2
#define SI32_SARADC_A_SQ7654_TS4CHR_CC2_U32 \
   (SI32_SARADC_A_SQ7654_TS4CHR_CC2_VALUE << SI32_SARADC_A_SQ7654_TS4CHR_SHIFT)
// Select conversion characteristic 3 for time slot 4.
#define SI32_SARADC_A_SQ7654_TS4CHR_CC3_VALUE  3
#define SI32_SARADC_A_SQ7654_TS4CHR_CC3_U32 \
   (SI32_SARADC_A_SQ7654_TS4CHR_CC3_VALUE << SI32_SARADC_A_SQ7654_TS4CHR_SHIFT)

#define SI32_SARADC_A_SQ7654_TS4MUX_MASK  0x0000007C
#define SI32_SARADC_A_SQ7654_TS4MUX_SHIFT  2
// Select channel ADCn.0.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN0_VALUE  0
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN0_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN0_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.1.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN1_VALUE  1
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN1_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN1_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.2.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN2_VALUE  2
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN2_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN2_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.3.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN3_VALUE  3
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN3_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN3_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.4.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN4_VALUE  4
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN4_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN4_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.5.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN5_VALUE  5
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN5_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN5_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.6.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN6_VALUE  6
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN6_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN6_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.7.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN7_VALUE  7
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN7_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN7_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.8.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN8_VALUE  8
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN8_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN8_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.9.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN9_VALUE  9
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN9_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN9_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.10.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN10_VALUE  10
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN10_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN10_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.11.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN11_VALUE  11
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN11_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN11_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.12.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN12_VALUE  12
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN12_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN12_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.13.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN13_VALUE  13
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN13_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN13_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.14.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN14_VALUE  14
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN14_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN14_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.15.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN15_VALUE  15
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN15_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN15_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.16.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN16_VALUE  16
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN16_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN16_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.17.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN17_VALUE  17
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN17_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN17_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.18.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN18_VALUE  18
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN18_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN18_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.19.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN19_VALUE  19
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN19_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN19_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.20.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN20_VALUE  20
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN20_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN20_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.21.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN21_VALUE  21
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN21_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN21_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.22.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN22_VALUE  22
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN22_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN22_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.23.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN23_VALUE  23
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN23_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN23_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.24.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN24_VALUE  24
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN24_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN24_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.25.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN25_VALUE  25
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN25_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN25_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.26.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN26_VALUE  26
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN26_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN26_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.27.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN27_VALUE  27
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN27_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN27_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.28.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN28_VALUE  28
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN28_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN28_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.29.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN29_VALUE  29
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN29_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN29_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// Select channel ADCn.30.
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN30_VALUE  30
#define SI32_SARADC_A_SQ7654_TS4MUX_ADCN30_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_ADCN30_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)
// None - End the sequence.
#define SI32_SARADC_A_SQ7654_TS4MUX_END_VALUE  31
#define SI32_SARADC_A_SQ7654_TS4MUX_END_U32 \
   (SI32_SARADC_A_SQ7654_TS4MUX_END_VALUE << SI32_SARADC_A_SQ7654_TS4MUX_SHIFT)

#define SI32_SARADC_A_SQ7654_TS5CHR_MASK  0x00000300
#define SI32_SARADC_A_SQ7654_TS5CHR_SHIFT  8
// Select conversion characteristic 0 for time slot 5.
#define SI32_SARADC_A_SQ7654_TS5CHR_CC0_VALUE  0
#define SI32_SARADC_A_SQ7654_TS5CHR_CC0_U32 \
   (SI32_SARADC_A_SQ7654_TS5CHR_CC0_VALUE << SI32_SARADC_A_SQ7654_TS5CHR_SHIFT)
// Select conversion characteristic 1 for time slot 5.
#define SI32_SARADC_A_SQ7654_TS5CHR_CC1_VALUE  1
#define SI32_SARADC_A_SQ7654_TS5CHR_CC1_U32 \
   (SI32_SARADC_A_SQ7654_TS5CHR_CC1_VALUE << SI32_SARADC_A_SQ7654_TS5CHR_SHIFT)
// Select conversion characteristic 2 for time slot 5.
#define SI32_SARADC_A_SQ7654_TS5CHR_CC2_VALUE  2
#define SI32_SARADC_A_SQ7654_TS5CHR_CC2_U32 \
   (SI32_SARADC_A_SQ7654_TS5CHR_CC2_VALUE << SI32_SARADC_A_SQ7654_TS5CHR_SHIFT)
// Select conversion characteristic 3 for time slot 5.
#define SI32_SARADC_A_SQ7654_TS5CHR_CC3_VALUE  3
#define SI32_SARADC_A_SQ7654_TS5CHR_CC3_U32 \
   (SI32_SARADC_A_SQ7654_TS5CHR_CC3_VALUE << SI32_SARADC_A_SQ7654_TS5CHR_SHIFT)

#define SI32_SARADC_A_SQ7654_TS5MUX_MASK  0x00007C00
#define SI32_SARADC_A_SQ7654_TS5MUX_SHIFT  10
// Select channel ADCn.0.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN0_VALUE  0
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN0_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN0_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.1.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN1_VALUE  1
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN1_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN1_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.2.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN2_VALUE  2
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN2_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN2_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.3.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN3_VALUE  3
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN3_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN3_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.4.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN4_VALUE  4
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN4_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN4_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.5.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN5_VALUE  5
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN5_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN5_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.6.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN6_VALUE  6
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN6_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN6_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.7.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN7_VALUE  7
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN7_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN7_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.8.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN8_VALUE  8
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN8_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN8_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.9.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN9_VALUE  9
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN9_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN9_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.10.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN10_VALUE  10
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN10_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN10_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.11.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN11_VALUE  11
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN11_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN11_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.12.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN12_VALUE  12
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN12_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN12_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.13.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN13_VALUE  13
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN13_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN13_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.14.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN14_VALUE  14
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN14_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN14_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.15.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN15_VALUE  15
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN15_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN15_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.16.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN16_VALUE  16
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN16_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN16_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.17.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN17_VALUE  17
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN17_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN17_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.18.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN18_VALUE  18
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN18_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN18_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.19.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN19_VALUE  19
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN19_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN19_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.20.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN20_VALUE  20
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN20_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN20_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.21.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN21_VALUE  21
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN21_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN21_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.22.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN22_VALUE  22
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN22_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN22_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.23.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN23_VALUE  23
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN23_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN23_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.24.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN24_VALUE  24
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN24_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN24_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.25.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN25_VALUE  25
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN25_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN25_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.26.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN26_VALUE  26
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN26_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN26_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.27.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN27_VALUE  27
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN27_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN27_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.28.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN28_VALUE  28
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN28_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN28_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.29.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN29_VALUE  29
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN29_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN29_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// Select channel ADCn.30.
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN30_VALUE  30
#define SI32_SARADC_A_SQ7654_TS5MUX_ADCN30_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_ADCN30_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)
// None - End the sequence.
#define SI32_SARADC_A_SQ7654_TS5MUX_END_VALUE  31
#define SI32_SARADC_A_SQ7654_TS5MUX_END_U32 \
   (SI32_SARADC_A_SQ7654_TS5MUX_END_VALUE << SI32_SARADC_A_SQ7654_TS5MUX_SHIFT)

#define SI32_SARADC_A_SQ7654_TS6CHR_MASK  0x00030000
#define SI32_SARADC_A_SQ7654_TS6CHR_SHIFT  16
// Select conversion characteristic 0 for time slot 6.
#define SI32_SARADC_A_SQ7654_TS6CHR_CC0_VALUE  0
#define SI32_SARADC_A_SQ7654_TS6CHR_CC0_U32 \
   (SI32_SARADC_A_SQ7654_TS6CHR_CC0_VALUE << SI32_SARADC_A_SQ7654_TS6CHR_SHIFT)
// Select conversion characteristic 1 for time slot 6.
#define SI32_SARADC_A_SQ7654_TS6CHR_CC1_VALUE  1
#define SI32_SARADC_A_SQ7654_TS6CHR_CC1_U32 \
   (SI32_SARADC_A_SQ7654_TS6CHR_CC1_VALUE << SI32_SARADC_A_SQ7654_TS6CHR_SHIFT)
// Select conversion characteristic 2 for time slot 6.
#define SI32_SARADC_A_SQ7654_TS6CHR_CC2_VALUE  2
#define SI32_SARADC_A_SQ7654_TS6CHR_CC2_U32 \
   (SI32_SARADC_A_SQ7654_TS6CHR_CC2_VALUE << SI32_SARADC_A_SQ7654_TS6CHR_SHIFT)
// Select conversion characteristic 3 for time slot 6.
#define SI32_SARADC_A_SQ7654_TS6CHR_CC3_VALUE  3
#define SI32_SARADC_A_SQ7654_TS6CHR_CC3_U32 \
   (SI32_SARADC_A_SQ7654_TS6CHR_CC3_VALUE << SI32_SARADC_A_SQ7654_TS6CHR_SHIFT)

