jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SARADC_A_Registers.h
#define SI32_SARADC_A_SQ7654_TS6MUX_MASK  0x007C0000
#define SI32_SARADC_A_SQ7654_TS6MUX_SHIFT  18
// Select channel ADCn.0.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN0_VALUE  0
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN0_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN0_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.1.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN1_VALUE  1
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN1_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN1_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.2.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN2_VALUE  2
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN2_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN2_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.3.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN3_VALUE  3
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN3_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN3_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.4.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN4_VALUE  4
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN4_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN4_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.5.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN5_VALUE  5
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN5_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN5_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.6.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN6_VALUE  6
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN6_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN6_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.7.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN7_VALUE  7
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN7_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN7_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.8.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN8_VALUE  8
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN8_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN8_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.9.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN9_VALUE  9
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN9_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN9_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.10.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN10_VALUE  10
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN10_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN10_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.11.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN11_VALUE  11
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN11_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN11_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.12.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN12_VALUE  12
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN12_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN12_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.13.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN13_VALUE  13
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN13_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN13_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.14.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN14_VALUE  14
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN14_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN14_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.15.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN15_VALUE  15
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN15_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN15_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.16.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN16_VALUE  16
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN16_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN16_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.17.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN17_VALUE  17
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN17_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN17_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.18.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN18_VALUE  18
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN18_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN18_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.19.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN19_VALUE  19
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN19_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN19_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.20.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN20_VALUE  20
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN20_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN20_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.21.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN21_VALUE  21
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN21_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN21_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.22.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN22_VALUE  22
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN22_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN22_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.23.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN23_VALUE  23
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN23_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN23_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.24.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN24_VALUE  24
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN24_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN24_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.25.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN25_VALUE  25
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN25_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN25_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.26.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN26_VALUE  26
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN26_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN26_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.27.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN27_VALUE  27
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN27_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN27_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.28.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN28_VALUE  28
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN28_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN28_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.29.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN29_VALUE  29
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN29_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN29_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// Select channel ADCn.30.
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN30_VALUE  30
#define SI32_SARADC_A_SQ7654_TS6MUX_ADCN30_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_ADCN30_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)
// None - End the sequence.
#define SI32_SARADC_A_SQ7654_TS6MUX_END_VALUE  31
#define SI32_SARADC_A_SQ7654_TS6MUX_END_U32 \
   (SI32_SARADC_A_SQ7654_TS6MUX_END_VALUE << SI32_SARADC_A_SQ7654_TS6MUX_SHIFT)

#define SI32_SARADC_A_SQ7654_TS7CHR_MASK  0x03000000
#define SI32_SARADC_A_SQ7654_TS7CHR_SHIFT  24
// Select conversion characteristic 0 for time slot 7.
#define SI32_SARADC_A_SQ7654_TS7CHR_CC0_VALUE  0
#define SI32_SARADC_A_SQ7654_TS7CHR_CC0_U32 \
   (SI32_SARADC_A_SQ7654_TS7CHR_CC0_VALUE << SI32_SARADC_A_SQ7654_TS7CHR_SHIFT)
// Select conversion characteristic 1 for time slot 7.
#define SI32_SARADC_A_SQ7654_TS7CHR_CC1_VALUE  1
#define SI32_SARADC_A_SQ7654_TS7CHR_CC1_U32 \
   (SI32_SARADC_A_SQ7654_TS7CHR_CC1_VALUE << SI32_SARADC_A_SQ7654_TS7CHR_SHIFT)
// Select conversion characteristic 2 for time slot 7.
#define SI32_SARADC_A_SQ7654_TS7CHR_CC2_VALUE  2
#define SI32_SARADC_A_SQ7654_TS7CHR_CC2_U32 \
   (SI32_SARADC_A_SQ7654_TS7CHR_CC2_VALUE << SI32_SARADC_A_SQ7654_TS7CHR_SHIFT)
// Select conversion characteristic 3 for time slot 7.
#define SI32_SARADC_A_SQ7654_TS7CHR_CC3_VALUE  3
#define SI32_SARADC_A_SQ7654_TS7CHR_CC3_U32 \
   (SI32_SARADC_A_SQ7654_TS7CHR_CC3_VALUE << SI32_SARADC_A_SQ7654_TS7CHR_SHIFT)

#define SI32_SARADC_A_SQ7654_TS7MUX_MASK  0x7C000000
#define SI32_SARADC_A_SQ7654_TS7MUX_SHIFT  26
// Select channel ADCn.0.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN0_VALUE  0
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN0_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN0_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.1.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN1_VALUE  1
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN1_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN1_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.2.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN2_VALUE  2
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN2_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN2_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.3.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN3_VALUE  3
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN3_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN3_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.4.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN4_VALUE  4
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN4_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN4_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.5.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN5_VALUE  5
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN5_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN5_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.6.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN6_VALUE  6
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN6_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN6_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.7.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN7_VALUE  7
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN7_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN7_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.8.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN8_VALUE  8
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN8_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN8_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.9.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN9_VALUE  9
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN9_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN9_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.10.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN10_VALUE  10
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN10_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN10_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.11.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN11_VALUE  11
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN11_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN11_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.12.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN12_VALUE  12
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN12_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN12_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.13.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN13_VALUE  13
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN13_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN13_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.14.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN14_VALUE  14
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN14_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN14_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.15.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN15_VALUE  15
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN15_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN15_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.16.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN16_VALUE  16
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN16_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN16_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.17.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN17_VALUE  17
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN17_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN17_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.18.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN18_VALUE  18
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN18_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN18_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.19.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN19_VALUE  19
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN19_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN19_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.20.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN20_VALUE  20
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN20_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN20_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.21.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN21_VALUE  21
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN21_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN21_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.22.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN22_VALUE  22
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN22_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN22_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.23.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN23_VALUE  23
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN23_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN23_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.24.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN24_VALUE  24
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN24_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN24_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.25.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN25_VALUE  25
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN25_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN25_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.26.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN26_VALUE  26
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN26_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN26_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.27.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN27_VALUE  27
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN27_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN27_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.28.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN28_VALUE  28
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN28_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN28_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.29.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN29_VALUE  29
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN29_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN29_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// Select channel ADCn.30.
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN30_VALUE  30
#define SI32_SARADC_A_SQ7654_TS7MUX_ADCN30_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_ADCN30_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)
// None - End the sequence.
#define SI32_SARADC_A_SQ7654_TS7MUX_END_VALUE  31
#define SI32_SARADC_A_SQ7654_TS7MUX_END_U32 \
   (SI32_SARADC_A_SQ7654_TS7MUX_END_VALUE << SI32_SARADC_A_SQ7654_TS7MUX_SHIFT)



struct SI32_SARADC_A_SQ3210_Struct
{
   union
   {
      struct
      {
         // Time Slot 0 Conversion Characteristic
         volatile uint32_t TS0CHR: 2;
         // Time Slot 0 Input Channel
         volatile uint32_t TS0MUX: 5;
                  uint32_t reserved0: 1;
         // Time Slot 1 Conversion Characteristic
         volatile uint32_t TS1CHR: 2;
         // Time Slot 1 Input Channel
         volatile uint32_t TS1MUX: 5;
                  uint32_t reserved1: 1;
         // Time Slot 2 Conversion Characteristic
         volatile uint32_t TS2CHR: 2;
         // Time Slot 2 Input Channel
         volatile uint32_t TS2MUX: 5;
                  uint32_t reserved2: 1;
         // Time Slot 3 Conversion Characteristic
         volatile uint32_t TS3CHR: 2;
         // Time Slot 3 Input Channel
         volatile uint32_t TS3MUX: 5;
                  uint32_t reserved3: 1;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SARADC_A_SQ3210_TS0CHR_MASK  0x00000003
#define SI32_SARADC_A_SQ3210_TS0CHR_SHIFT  0
// Select conversion characteristic 0 for time slot 0.
#define SI32_SARADC_A_SQ3210_TS0CHR_CC0_VALUE  0
#define SI32_SARADC_A_SQ3210_TS0CHR_CC0_U32 \
   (SI32_SARADC_A_SQ3210_TS0CHR_CC0_VALUE << SI32_SARADC_A_SQ3210_TS0CHR_SHIFT)
// Select conversion characteristic 1 for time slot 0.
#define SI32_SARADC_A_SQ3210_TS0CHR_CC1_VALUE  1
#define SI32_SARADC_A_SQ3210_TS0CHR_CC1_U32 \
   (SI32_SARADC_A_SQ3210_TS0CHR_CC1_VALUE << SI32_SARADC_A_SQ3210_TS0CHR_SHIFT)
// Select conversion characteristic 2 for time slot 0.
#define SI32_SARADC_A_SQ3210_TS0CHR_CC2_VALUE  2
#define SI32_SARADC_A_SQ3210_TS0CHR_CC2_U32 \
   (SI32_SARADC_A_SQ3210_TS0CHR_CC2_VALUE << SI32_SARADC_A_SQ3210_TS0CHR_SHIFT)
// Select conversion characteristic 3 for time slot 0.
#define SI32_SARADC_A_SQ3210_TS0CHR_CC3_VALUE  3
#define SI32_SARADC_A_SQ3210_TS0CHR_CC3_U32 \
   (SI32_SARADC_A_SQ3210_TS0CHR_CC3_VALUE << SI32_SARADC_A_SQ3210_TS0CHR_SHIFT)

#define SI32_SARADC_A_SQ3210_TS0MUX_MASK  0x0000007C
#define SI32_SARADC_A_SQ3210_TS0MUX_SHIFT  2
// Select channel ADCn.0.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN0_VALUE  0
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN0_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN0_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.1.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN1_VALUE  1
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN1_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN1_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.2.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN2_VALUE  2
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN2_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN2_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.3.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN3_VALUE  3
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN3_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN3_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.4.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN4_VALUE  4
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN4_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN4_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.5.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN5_VALUE  5
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN5_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN5_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.6.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN6_VALUE  6
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN6_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN6_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.7.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN7_VALUE  7
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN7_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN7_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.8.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN8_VALUE  8
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN8_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN8_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.9.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN9_VALUE  9
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN9_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN9_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.10.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN10_VALUE  10
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN10_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN10_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.11.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN11_VALUE  11
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN11_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN11_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.12.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN12_VALUE  12
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN12_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN12_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.13.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN13_VALUE  13
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN13_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN13_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.14.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN14_VALUE  14
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN14_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN14_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.15.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN15_VALUE  15
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN15_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN15_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.16.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN16_VALUE  16
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN16_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN16_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.17.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN17_VALUE  17
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN17_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN17_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.18.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN18_VALUE  18
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN18_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN18_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.19.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN19_VALUE  19
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN19_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN19_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.20.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN20_VALUE  20
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN20_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN20_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.21.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN21_VALUE  21
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN21_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN21_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.22.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN22_VALUE  22
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN22_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN22_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.23.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN23_VALUE  23
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN23_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN23_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.24.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN24_VALUE  24
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN24_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN24_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.25.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN25_VALUE  25
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN25_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN25_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.26.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN26_VALUE  26
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN26_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN26_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.27.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN27_VALUE  27
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN27_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN27_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.28.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN28_VALUE  28
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN28_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN28_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.29.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN29_VALUE  29
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN29_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN29_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// Select channel ADCn.30.
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN30_VALUE  30
#define SI32_SARADC_A_SQ3210_TS0MUX_ADCN30_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_ADCN30_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)
// None - End the sequence.
#define SI32_SARADC_A_SQ3210_TS0MUX_END_VALUE  31
#define SI32_SARADC_A_SQ3210_TS0MUX_END_U32 \
   (SI32_SARADC_A_SQ3210_TS0MUX_END_VALUE << SI32_SARADC_A_SQ3210_TS0MUX_SHIFT)

