jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SARADC_A_Registers.h
struct SI32_SARADC_A_CHAR32_Struct
{
   union
   {
      struct
      {
         // Conversion Characteristic 2 Gain
         volatile uint32_t CHR2GN: 1;
         // Conversion Characteristic 2 Repeat Counter
         volatile uint32_t CHR2RPT: 3;
         // Conversion Characteristic 2 Left-Shift Bits
         volatile uint32_t CHR2LS: 3;
         // Conversion Characteristic 2 Resolution Selection
         volatile uint32_t CHR2RSEL: 1;
         // Conversion Characteristic 2 Window Comparator Interrupt Enable
         volatile uint32_t CHR2WCIEN: 1;
                  uint32_t reserved0: 7;
         // Conversion Characteristic 3 Gain
         volatile uint32_t CHR3GN: 1;
         // Conversion Characteristic 3 Repeat Counter
         volatile uint32_t CHR3RPT: 3;
         // Conversion Characteristic 3 Left-Shift Bits
         volatile uint32_t CHR3LS: 3;
         // Conversion Characteristic 3 Resolution Selection
         volatile uint32_t CHR3RSEL: 1;
         // Conversion Characteristic 3 Window Comparator Interrupt Enable
         volatile uint32_t CHR3WCIEN: 1;
                  uint32_t reserved1: 7;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SARADC_A_CHAR32_CHR2GN_MASK  0x00000001
#define SI32_SARADC_A_CHAR32_CHR2GN_SHIFT  0
// The on-chip PGA gain is 1.
#define SI32_SARADC_A_CHAR32_CHR2GN_UNITY_VALUE  0
#define SI32_SARADC_A_CHAR32_CHR2GN_UNITY_U32 \
   (SI32_SARADC_A_CHAR32_CHR2GN_UNITY_VALUE << SI32_SARADC_A_CHAR32_CHR2GN_SHIFT)
// The on-chip PGA gain is 0.5.
#define SI32_SARADC_A_CHAR32_CHR2GN_HALF_VALUE  1
#define SI32_SARADC_A_CHAR32_CHR2GN_HALF_U32 \
   (SI32_SARADC_A_CHAR32_CHR2GN_HALF_VALUE << SI32_SARADC_A_CHAR32_CHR2GN_SHIFT)

#define SI32_SARADC_A_CHAR32_CHR2RPT_MASK  0x0000000E
#define SI32_SARADC_A_CHAR32_CHR2RPT_SHIFT  1
// Accumulate one sample.
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC1_VALUE  0
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC1_U32 \
   (SI32_SARADC_A_CHAR32_CHR2RPT_ACC1_VALUE << SI32_SARADC_A_CHAR32_CHR2RPT_SHIFT)
// Accumulate four samples.
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC4_VALUE  1
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC4_U32 \
   (SI32_SARADC_A_CHAR32_CHR2RPT_ACC4_VALUE << SI32_SARADC_A_CHAR32_CHR2RPT_SHIFT)
// Accumulate eight samples.
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC8_VALUE  2
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC8_U32 \
   (SI32_SARADC_A_CHAR32_CHR2RPT_ACC8_VALUE << SI32_SARADC_A_CHAR32_CHR2RPT_SHIFT)
// Accumulate sixteen samples.
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC16_VALUE  3
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC16_U32 \
   (SI32_SARADC_A_CHAR32_CHR2RPT_ACC16_VALUE << SI32_SARADC_A_CHAR32_CHR2RPT_SHIFT)
// Accumulate thirty-two samples (10-bit mode only).
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC32_VALUE  4
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC32_U32 \
   (SI32_SARADC_A_CHAR32_CHR2RPT_ACC32_VALUE << SI32_SARADC_A_CHAR32_CHR2RPT_SHIFT)
// Accumulate sixty-four samples (10-bit mode only).
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC64_VALUE  5
#define SI32_SARADC_A_CHAR32_CHR2RPT_ACC64_U32 \
   (SI32_SARADC_A_CHAR32_CHR2RPT_ACC64_VALUE << SI32_SARADC_A_CHAR32_CHR2RPT_SHIFT)

#define SI32_SARADC_A_CHAR32_CHR2LS_MASK  0x00000070
#define SI32_SARADC_A_CHAR32_CHR2LS_SHIFT  4

#define SI32_SARADC_A_CHAR32_CHR2RSEL_MASK  0x00000080
#define SI32_SARADC_A_CHAR32_CHR2RSEL_SHIFT  7
// Select 10-bit Mode.
#define SI32_SARADC_A_CHAR32_CHR2RSEL_B10_VALUE  0
#define SI32_SARADC_A_CHAR32_CHR2RSEL_B10_U32 \
   (SI32_SARADC_A_CHAR32_CHR2RSEL_B10_VALUE << SI32_SARADC_A_CHAR32_CHR2RSEL_SHIFT)
// Select 12-bit Mode (burst mode must be enabled).
#define SI32_SARADC_A_CHAR32_CHR2RSEL_B12_VALUE  1
#define SI32_SARADC_A_CHAR32_CHR2RSEL_B12_U32 \
   (SI32_SARADC_A_CHAR32_CHR2RSEL_B12_VALUE << SI32_SARADC_A_CHAR32_CHR2RSEL_SHIFT)

#define SI32_SARADC_A_CHAR32_CHR2WCIEN_MASK  0x00000100
#define SI32_SARADC_A_CHAR32_CHR2WCIEN_SHIFT  8
// Disable window comparison interrupts.
#define SI32_SARADC_A_CHAR32_CHR2WCIEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CHAR32_CHR2WCIEN_DISABLED_U32 \
   (SI32_SARADC_A_CHAR32_CHR2WCIEN_DISABLED_VALUE << SI32_SARADC_A_CHAR32_CHR2WCIEN_SHIFT)
// Enabled window comparison interrupts.  The window comparator will be used to
// check the ADC result on channels that use this characteristic.
#define SI32_SARADC_A_CHAR32_CHR2WCIEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CHAR32_CHR2WCIEN_ENABLED_U32 \
   (SI32_SARADC_A_CHAR32_CHR2WCIEN_ENABLED_VALUE << SI32_SARADC_A_CHAR32_CHR2WCIEN_SHIFT)

#define SI32_SARADC_A_CHAR32_CHR3GN_MASK  0x00010000
#define SI32_SARADC_A_CHAR32_CHR3GN_SHIFT  16
// The on-chip PGA gain is 1.
#define SI32_SARADC_A_CHAR32_CHR3GN_UNITY_VALUE  0
#define SI32_SARADC_A_CHAR32_CHR3GN_UNITY_U32 \
   (SI32_SARADC_A_CHAR32_CHR3GN_UNITY_VALUE << SI32_SARADC_A_CHAR32_CHR3GN_SHIFT)
// The on-chip PGA gain is 0.5.
#define SI32_SARADC_A_CHAR32_CHR3GN_HALF_VALUE  1
#define SI32_SARADC_A_CHAR32_CHR3GN_HALF_U32 \
   (SI32_SARADC_A_CHAR32_CHR3GN_HALF_VALUE << SI32_SARADC_A_CHAR32_CHR3GN_SHIFT)

#define SI32_SARADC_A_CHAR32_CHR3RPT_MASK  0x000E0000
#define SI32_SARADC_A_CHAR32_CHR3RPT_SHIFT  17
// Accumulate one sample.
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC1_VALUE  0
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC1_U32 \
   (SI32_SARADC_A_CHAR32_CHR3RPT_ACC1_VALUE << SI32_SARADC_A_CHAR32_CHR3RPT_SHIFT)
// Accumulate four samples.
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC4_VALUE  1
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC4_U32 \
   (SI32_SARADC_A_CHAR32_CHR3RPT_ACC4_VALUE << SI32_SARADC_A_CHAR32_CHR3RPT_SHIFT)
// Accumulate eight samples.
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC8_VALUE  2
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC8_U32 \
   (SI32_SARADC_A_CHAR32_CHR3RPT_ACC8_VALUE << SI32_SARADC_A_CHAR32_CHR3RPT_SHIFT)
// Accumulate sixteen samples.
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC16_VALUE  3
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC16_U32 \
   (SI32_SARADC_A_CHAR32_CHR3RPT_ACC16_VALUE << SI32_SARADC_A_CHAR32_CHR3RPT_SHIFT)
// Accumulate thirty-two samples (10-bit mode only).
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC32_VALUE  4
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC32_U32 \
   (SI32_SARADC_A_CHAR32_CHR3RPT_ACC32_VALUE << SI32_SARADC_A_CHAR32_CHR3RPT_SHIFT)
// Accumulate sixty-four samples (10-bit mode only).
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC64_VALUE  5
#define SI32_SARADC_A_CHAR32_CHR3RPT_ACC64_U32 \
   (SI32_SARADC_A_CHAR32_CHR3RPT_ACC64_VALUE << SI32_SARADC_A_CHAR32_CHR3RPT_SHIFT)

#define SI32_SARADC_A_CHAR32_CHR3LS_MASK  0x00700000
#define SI32_SARADC_A_CHAR32_CHR3LS_SHIFT  20

#define SI32_SARADC_A_CHAR32_CHR3RSEL_MASK  0x00800000
#define SI32_SARADC_A_CHAR32_CHR3RSEL_SHIFT  23
// Select 10-bit Mode.
#define SI32_SARADC_A_CHAR32_CHR3RSEL_B10_VALUE  0
#define SI32_SARADC_A_CHAR32_CHR3RSEL_B10_U32 \
   (SI32_SARADC_A_CHAR32_CHR3RSEL_B10_VALUE << SI32_SARADC_A_CHAR32_CHR3RSEL_SHIFT)
// Select 12-bit Mode (burst mode must be enabled).
#define SI32_SARADC_A_CHAR32_CHR3RSEL_B12_VALUE  1
#define SI32_SARADC_A_CHAR32_CHR3RSEL_B12_U32 \
   (SI32_SARADC_A_CHAR32_CHR3RSEL_B12_VALUE << SI32_SARADC_A_CHAR32_CHR3RSEL_SHIFT)

#define SI32_SARADC_A_CHAR32_CHR3WCIEN_MASK  0x01000000
#define SI32_SARADC_A_CHAR32_CHR3WCIEN_SHIFT  24
// Disable window comparison interrupts.
#define SI32_SARADC_A_CHAR32_CHR3WCIEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CHAR32_CHR3WCIEN_DISABLED_U32 \
   (SI32_SARADC_A_CHAR32_CHR3WCIEN_DISABLED_VALUE << SI32_SARADC_A_CHAR32_CHR3WCIEN_SHIFT)
// Enabled window comparison interrupts.  The window comparator will be used to
// check the ADC result on channels that use this characteristic.
#define SI32_SARADC_A_CHAR32_CHR3WCIEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CHAR32_CHR3WCIEN_ENABLED_U32 \
   (SI32_SARADC_A_CHAR32_CHR3WCIEN_ENABLED_VALUE << SI32_SARADC_A_CHAR32_CHR3WCIEN_SHIFT)



struct SI32_SARADC_A_CHAR10_Struct
{
   union
   {
      struct
      {
         // Conversion Characteristic 0 Gain
         volatile uint32_t CHR0GN: 1;
         // Conversion Characteristic 0 Repeat Counter
         volatile uint32_t CHR0RPT: 3;
         // Conversion Characteristic 0 Left-Shift Bits
         volatile uint32_t CHR0LS: 3;
         // Conversion Characteristic 0 Resolution Selection
         volatile uint32_t CHR0RSEL: 1;
         // Conversion Characteristic 0 Window Comparator Interrupt Enable
         volatile uint32_t CHR0WCIEN: 1;
                  uint32_t reserved0: 7;
         // Conversion Characteristic 1 Gain
         volatile uint32_t CHR1GN: 1;
         // Conversion Characteristic 1 Repeat Counter
         volatile uint32_t CHR1RPT: 3;
         // Conversion Characteristic 1 Left-Shift Bits
         volatile uint32_t CHR1LS: 3;
         // Conversion Characteristic 1 Resolution Selection
         volatile uint32_t CHR1RSEL: 1;
         // Conversion Characteristic 1 Window Comparator Interrupt Enable
         volatile uint32_t CHR1WCIEN: 1;
                  uint32_t reserved1: 7;
      };
      volatile uint32_t U32;
   };
};

