jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SARADC_A_Registers.h
#define SI32_SARADC_A_CHAR10_CHR0GN_MASK  0x00000001
#define SI32_SARADC_A_CHAR10_CHR0GN_SHIFT  0
// The on-chip PGA gain is 1.
#define SI32_SARADC_A_CHAR10_CHR0GN_UNITY_VALUE  0
#define SI32_SARADC_A_CHAR10_CHR0GN_UNITY_U32 \
   (SI32_SARADC_A_CHAR10_CHR0GN_UNITY_VALUE << SI32_SARADC_A_CHAR10_CHR0GN_SHIFT)
// The on-chip PGA gain is 0.5.
#define SI32_SARADC_A_CHAR10_CHR0GN_HALF_VALUE  1
#define SI32_SARADC_A_CHAR10_CHR0GN_HALF_U32 \
   (SI32_SARADC_A_CHAR10_CHR0GN_HALF_VALUE << SI32_SARADC_A_CHAR10_CHR0GN_SHIFT)

#define SI32_SARADC_A_CHAR10_CHR0RPT_MASK  0x0000000E
#define SI32_SARADC_A_CHAR10_CHR0RPT_SHIFT  1
// Accumulate one sample.
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC1_VALUE  0
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC1_U32 \
   (SI32_SARADC_A_CHAR10_CHR0RPT_ACC1_VALUE << SI32_SARADC_A_CHAR10_CHR0RPT_SHIFT)
// Accumulate four samples.
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC4_VALUE  1
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC4_U32 \
   (SI32_SARADC_A_CHAR10_CHR0RPT_ACC4_VALUE << SI32_SARADC_A_CHAR10_CHR0RPT_SHIFT)
// Accumulate eight samples.
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC8_VALUE  2
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC8_U32 \
   (SI32_SARADC_A_CHAR10_CHR0RPT_ACC8_VALUE << SI32_SARADC_A_CHAR10_CHR0RPT_SHIFT)
// Accumulate sixteen samples.
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC16_VALUE  3
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC16_U32 \
   (SI32_SARADC_A_CHAR10_CHR0RPT_ACC16_VALUE << SI32_SARADC_A_CHAR10_CHR0RPT_SHIFT)
// Accumulate thirty-two samples (10-bit mode only).
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC32_VALUE  4
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC32_U32 \
   (SI32_SARADC_A_CHAR10_CHR0RPT_ACC32_VALUE << SI32_SARADC_A_CHAR10_CHR0RPT_SHIFT)
// Accumulate sixty-four samples (10-bit mode only).
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC64_VALUE  5
#define SI32_SARADC_A_CHAR10_CHR0RPT_ACC64_U32 \
   (SI32_SARADC_A_CHAR10_CHR0RPT_ACC64_VALUE << SI32_SARADC_A_CHAR10_CHR0RPT_SHIFT)

#define SI32_SARADC_A_CHAR10_CHR0LS_MASK  0x00000070
#define SI32_SARADC_A_CHAR10_CHR0LS_SHIFT  4

#define SI32_SARADC_A_CHAR10_CHR0RSEL_MASK  0x00000080
#define SI32_SARADC_A_CHAR10_CHR0RSEL_SHIFT  7
// Select 10-bit Mode.
#define SI32_SARADC_A_CHAR10_CHR0RSEL_B10_VALUE  0
#define SI32_SARADC_A_CHAR10_CHR0RSEL_B10_U32 \
   (SI32_SARADC_A_CHAR10_CHR0RSEL_B10_VALUE << SI32_SARADC_A_CHAR10_CHR0RSEL_SHIFT)
// Select 12-bit Mode (burst mode must be enabled).
#define SI32_SARADC_A_CHAR10_CHR0RSEL_B12_VALUE  1
#define SI32_SARADC_A_CHAR10_CHR0RSEL_B12_U32 \
   (SI32_SARADC_A_CHAR10_CHR0RSEL_B12_VALUE << SI32_SARADC_A_CHAR10_CHR0RSEL_SHIFT)

#define SI32_SARADC_A_CHAR10_CHR0WCIEN_MASK  0x00000100
#define SI32_SARADC_A_CHAR10_CHR0WCIEN_SHIFT  8
// Disable window comparison interrupts.
#define SI32_SARADC_A_CHAR10_CHR0WCIEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CHAR10_CHR0WCIEN_DISABLED_U32 \
   (SI32_SARADC_A_CHAR10_CHR0WCIEN_DISABLED_VALUE << SI32_SARADC_A_CHAR10_CHR0WCIEN_SHIFT)
// Enabled window comparison interrupts.  The window comparator will be used to
// check the ADC result on channels that use this characteristic.
#define SI32_SARADC_A_CHAR10_CHR0WCIEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CHAR10_CHR0WCIEN_ENABLED_U32 \
   (SI32_SARADC_A_CHAR10_CHR0WCIEN_ENABLED_VALUE << SI32_SARADC_A_CHAR10_CHR0WCIEN_SHIFT)

#define SI32_SARADC_A_CHAR10_CHR1GN_MASK  0x00010000
#define SI32_SARADC_A_CHAR10_CHR1GN_SHIFT  16
// The on-chip PGA gain is 1.
#define SI32_SARADC_A_CHAR10_CHR1GN_UNITY_VALUE  0
#define SI32_SARADC_A_CHAR10_CHR1GN_UNITY_U32 \
   (SI32_SARADC_A_CHAR10_CHR1GN_UNITY_VALUE << SI32_SARADC_A_CHAR10_CHR1GN_SHIFT)
// The on-chip PGA gain is 0.5.
#define SI32_SARADC_A_CHAR10_CHR1GN_HALF_VALUE  1
#define SI32_SARADC_A_CHAR10_CHR1GN_HALF_U32 \
   (SI32_SARADC_A_CHAR10_CHR1GN_HALF_VALUE << SI32_SARADC_A_CHAR10_CHR1GN_SHIFT)

#define SI32_SARADC_A_CHAR10_CHR1RPT_MASK  0x000E0000
#define SI32_SARADC_A_CHAR10_CHR1RPT_SHIFT  17
// Accumulate one sample.
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC1_VALUE  0
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC1_U32 \
   (SI32_SARADC_A_CHAR10_CHR1RPT_ACC1_VALUE << SI32_SARADC_A_CHAR10_CHR1RPT_SHIFT)
// Accumulate four samples.
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC4_VALUE  1
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC4_U32 \
   (SI32_SARADC_A_CHAR10_CHR1RPT_ACC4_VALUE << SI32_SARADC_A_CHAR10_CHR1RPT_SHIFT)
// Accumulate eight samples.
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC8_VALUE  2
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC8_U32 \
   (SI32_SARADC_A_CHAR10_CHR1RPT_ACC8_VALUE << SI32_SARADC_A_CHAR10_CHR1RPT_SHIFT)
// Accumulate sixteen samples.
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC16_VALUE  3
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC16_U32 \
   (SI32_SARADC_A_CHAR10_CHR1RPT_ACC16_VALUE << SI32_SARADC_A_CHAR10_CHR1RPT_SHIFT)
// Accumulate thirty-two samples (10-bit mode only).
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC32_VALUE  4
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC32_U32 \
   (SI32_SARADC_A_CHAR10_CHR1RPT_ACC32_VALUE << SI32_SARADC_A_CHAR10_CHR1RPT_SHIFT)
// Accumulate sixty-four samples (10-bit mode only).
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC64_VALUE  5
#define SI32_SARADC_A_CHAR10_CHR1RPT_ACC64_U32 \
   (SI32_SARADC_A_CHAR10_CHR1RPT_ACC64_VALUE << SI32_SARADC_A_CHAR10_CHR1RPT_SHIFT)

#define SI32_SARADC_A_CHAR10_CHR1LS_MASK  0x00700000
#define SI32_SARADC_A_CHAR10_CHR1LS_SHIFT  20

#define SI32_SARADC_A_CHAR10_CHR1RSEL_MASK  0x00800000
#define SI32_SARADC_A_CHAR10_CHR1RSEL_SHIFT  23
// Select 10-bit Mode.
#define SI32_SARADC_A_CHAR10_CHR1RSEL_B10_VALUE  0
#define SI32_SARADC_A_CHAR10_CHR1RSEL_B10_U32 \
   (SI32_SARADC_A_CHAR10_CHR1RSEL_B10_VALUE << SI32_SARADC_A_CHAR10_CHR1RSEL_SHIFT)
// Select 12-bit Mode (burst mode must be enabled).
#define SI32_SARADC_A_CHAR10_CHR1RSEL_B12_VALUE  1
#define SI32_SARADC_A_CHAR10_CHR1RSEL_B12_U32 \
   (SI32_SARADC_A_CHAR10_CHR1RSEL_B12_VALUE << SI32_SARADC_A_CHAR10_CHR1RSEL_SHIFT)

#define SI32_SARADC_A_CHAR10_CHR1WCIEN_MASK  0x01000000
#define SI32_SARADC_A_CHAR10_CHR1WCIEN_SHIFT  24
// Disable window comparison interrupts.
#define SI32_SARADC_A_CHAR10_CHR1WCIEN_DISABLED_VALUE  0
#define SI32_SARADC_A_CHAR10_CHR1WCIEN_DISABLED_U32 \
   (SI32_SARADC_A_CHAR10_CHR1WCIEN_DISABLED_VALUE << SI32_SARADC_A_CHAR10_CHR1WCIEN_SHIFT)
// Enabled window comparison interrupts.  The window comparator will be used to
// check the ADC result on channels that use this characteristic.
#define SI32_SARADC_A_CHAR10_CHR1WCIEN_ENABLED_VALUE  1
#define SI32_SARADC_A_CHAR10_CHR1WCIEN_ENABLED_U32 \
   (SI32_SARADC_A_CHAR10_CHR1WCIEN_ENABLED_VALUE << SI32_SARADC_A_CHAR10_CHR1WCIEN_SHIFT)



struct SI32_SARADC_A_DATA_Struct
{
   union
   {
      struct
      {
         // Output Data Word
         volatile uint32_t DATA_BITS;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SARADC_A_DATA_DATA_MASK  0xFFFFFFFF
#define SI32_SARADC_A_DATA_DATA_SHIFT  0



struct SI32_SARADC_A_WCLIMITS_Struct
{
   union
   {
      struct
      {
         // Less-Than Window Comparator Limit
         volatile uint16_t WCLT;
         // Greater-Than Window Comparator Limit
         volatile uint16_t WCGT;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SARADC_A_WCLIMITS_WCLT_MASK  0x0000FFFF
#define SI32_SARADC_A_WCLIMITS_WCLT_SHIFT  0

#define SI32_SARADC_A_WCLIMITS_WCGT_MASK  0xFFFF0000
#define SI32_SARADC_A_WCLIMITS_WCGT_SHIFT  16



struct SI32_SARADC_A_ACC_Struct
{
   union
   {
      struct
      {
         // Accumulator Initial Value
         volatile uint16_t ACC_BITS;
                  uint32_t reserved0: 16;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SARADC_A_ACC_ACC_MASK  0x0000FFFF
#define SI32_SARADC_A_ACC_ACC_SHIFT  0



struct SI32_SARADC_A_STATUS_Struct
{
   union
   {
      struct
      {
         // Window Compare Interrupt
         volatile uint32_t WCI: 1;
         // Single Conversion Complete Interrupt
         volatile uint32_t SCCI: 1;
         // Scan Done Interrupt
         volatile uint32_t SDI: 1;
         // FIFO Overrun Interrupt
         volatile uint32_t FORI: 1;
         // FIFO Underrun Interrupt
         volatile uint32_t FURI: 1;
                  uint32_t reserved0: 27;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SARADC_A_STATUS_WCI_MASK  0x00000001
#define SI32_SARADC_A_STATUS_WCI_SHIFT  0
// Read: A window compare interrupt has not occurred. Write: Clear the interrupt.
#define SI32_SARADC_A_STATUS_WCI_NOT_SET_VALUE  0
#define SI32_SARADC_A_STATUS_WCI_NOT_SET_U32 \
   (SI32_SARADC_A_STATUS_WCI_NOT_SET_VALUE << SI32_SARADC_A_STATUS_WCI_SHIFT)
// Read: A window compare interrupt occurred. Write: Force a window compare
// interrupt.
#define SI32_SARADC_A_STATUS_WCI_SET_VALUE  1
#define SI32_SARADC_A_STATUS_WCI_SET_U32 \
   (SI32_SARADC_A_STATUS_WCI_SET_VALUE << SI32_SARADC_A_STATUS_WCI_SHIFT)

#define SI32_SARADC_A_STATUS_SCCI_MASK  0x00000002
#define SI32_SARADC_A_STATUS_SCCI_SHIFT  1
// Read: A single data conversion interrupt has not occurred. Write: Clear the
// interrupt.
#define SI32_SARADC_A_STATUS_SCCI_NOT_SET_VALUE  0
#define SI32_SARADC_A_STATUS_SCCI_NOT_SET_U32 \
   (SI32_SARADC_A_STATUS_SCCI_NOT_SET_VALUE << SI32_SARADC_A_STATUS_SCCI_SHIFT)
// Read: A single data conversion interrupt occurred. Write: Force a single data
// conversion interrupt.
#define SI32_SARADC_A_STATUS_SCCI_SET_VALUE  1
#define SI32_SARADC_A_STATUS_SCCI_SET_U32 \
   (SI32_SARADC_A_STATUS_SCCI_SET_VALUE << SI32_SARADC_A_STATUS_SCCI_SHIFT)

