jsnyder/FreakUSB/hw/sim3u1xx/si32Hal/SI32_Modules/SI32_SARADC_A_Registers.h
#define SI32_SARADC_A_STATUS_SDI_MASK  0x00000004
#define SI32_SARADC_A_STATUS_SDI_SHIFT  2
// Read: A scan done interrupt has not occurred. Write: Clear the interrupt.
#define SI32_SARADC_A_STATUS_SDI_NOT_SET_VALUE  0
#define SI32_SARADC_A_STATUS_SDI_NOT_SET_U32 \
   (SI32_SARADC_A_STATUS_SDI_NOT_SET_VALUE << SI32_SARADC_A_STATUS_SDI_SHIFT)
// Read: A scan done interrupt occurred. Write: Force a scan done interrupt.
#define SI32_SARADC_A_STATUS_SDI_SET_VALUE  1
#define SI32_SARADC_A_STATUS_SDI_SET_U32 \
   (SI32_SARADC_A_STATUS_SDI_SET_VALUE << SI32_SARADC_A_STATUS_SDI_SHIFT)

#define SI32_SARADC_A_STATUS_FORI_MASK  0x00000008
#define SI32_SARADC_A_STATUS_FORI_SHIFT  3
// Read: A data FIFO overrun interrupt has not occurred. Write: Clear the
// interrupt.
#define SI32_SARADC_A_STATUS_FORI_NOT_SET_VALUE  0
#define SI32_SARADC_A_STATUS_FORI_NOT_SET_U32 \
   (SI32_SARADC_A_STATUS_FORI_NOT_SET_VALUE << SI32_SARADC_A_STATUS_FORI_SHIFT)
// Read: A data FIFO overrun interrupt occurred. Write: Force a data FIFO overrun
// interrupt.
#define SI32_SARADC_A_STATUS_FORI_SET_VALUE  1
#define SI32_SARADC_A_STATUS_FORI_SET_U32 \
   (SI32_SARADC_A_STATUS_FORI_SET_VALUE << SI32_SARADC_A_STATUS_FORI_SHIFT)

#define SI32_SARADC_A_STATUS_FURI_MASK  0x00000010
#define SI32_SARADC_A_STATUS_FURI_SHIFT  4
// Read: A data FIFO underrun interrupt has not occurred. Write: Clear the
// interrupt.
#define SI32_SARADC_A_STATUS_FURI_NOT_SET_VALUE  0
#define SI32_SARADC_A_STATUS_FURI_NOT_SET_U32 \
   (SI32_SARADC_A_STATUS_FURI_NOT_SET_VALUE << SI32_SARADC_A_STATUS_FURI_SHIFT)
// Read: A data FIFO underrun interrupt occurred. Write: Force a data FIFO underrun
// interrupt.
#define SI32_SARADC_A_STATUS_FURI_SET_VALUE  1
#define SI32_SARADC_A_STATUS_FURI_SET_U32 \
   (SI32_SARADC_A_STATUS_FURI_SET_VALUE << SI32_SARADC_A_STATUS_FURI_SHIFT)



struct SI32_SARADC_A_FIFOSTATUS_Struct
{
   union
   {
      struct
      {
         // FIFO Level
         volatile uint32_t FIFOLVL: 4;
         // Data Packing Status
         volatile uint32_t DPSTS: 1;
         // Data Ready Flag
         volatile uint32_t DRDYF: 1;
                  uint32_t reserved0: 26;
      };
      volatile uint32_t U32;
   };
};

#define SI32_SARADC_A_FIFOSTATUS_FIFOLVL_MASK  0x0000000F
#define SI32_SARADC_A_FIFOSTATUS_FIFOLVL_SHIFT  0

#define SI32_SARADC_A_FIFOSTATUS_DPSTS_MASK  0x00000010
#define SI32_SARADC_A_FIFOSTATUS_DPSTS_SHIFT  4
// The next ADC conversion will be written to the lower half-word.
#define SI32_SARADC_A_FIFOSTATUS_DPSTS_LOWER_VALUE  0
#define SI32_SARADC_A_FIFOSTATUS_DPSTS_LOWER_U32 \
   (SI32_SARADC_A_FIFOSTATUS_DPSTS_LOWER_VALUE << SI32_SARADC_A_FIFOSTATUS_DPSTS_SHIFT)
// The next ADC conversion will be written to the upper half-word.
#define SI32_SARADC_A_FIFOSTATUS_DPSTS_UPPER_VALUE  1
#define SI32_SARADC_A_FIFOSTATUS_DPSTS_UPPER_U32 \
   (SI32_SARADC_A_FIFOSTATUS_DPSTS_UPPER_VALUE << SI32_SARADC_A_FIFOSTATUS_DPSTS_SHIFT)

#define SI32_SARADC_A_FIFOSTATUS_DRDYF_MASK  0x00000020
#define SI32_SARADC_A_FIFOSTATUS_DRDYF_SHIFT  5
// New data is not produced yet.
#define SI32_SARADC_A_FIFOSTATUS_DRDYF_NOT_SET_VALUE  0
#define SI32_SARADC_A_FIFOSTATUS_DRDYF_NOT_SET_U32 \
   (SI32_SARADC_A_FIFOSTATUS_DRDYF_NOT_SET_VALUE << SI32_SARADC_A_FIFOSTATUS_DRDYF_SHIFT)
// New data is ready.
#define SI32_SARADC_A_FIFOSTATUS_DRDYF_SET_VALUE  1
#define SI32_SARADC_A_FIFOSTATUS_DRDYF_SET_U32 \
   (SI32_SARADC_A_FIFOSTATUS_DRDYF_SET_VALUE << SI32_SARADC_A_FIFOSTATUS_DRDYF_SHIFT)



typedef struct SI32_SARADC_A_Struct
{
   struct SI32_SARADC_A_CONFIG_Struct              CONFIG         ; // Base Address + 0x0
   volatile uint32_t                               CONFIG_SET;
   volatile uint32_t                               CONFIG_CLR;
   uint32_t                                        reserved0;
   struct SI32_SARADC_A_CONTROL_Struct             CONTROL        ; // Base Address + 0x10
   volatile uint32_t                               CONTROL_SET;
   volatile uint32_t                               CONTROL_CLR;
   uint32_t                                        reserved1;
   struct SI32_SARADC_A_SQ7654_Struct              SQ7654         ; // Base Address + 0x20
   uint32_t                                        reserved2;
   uint32_t                                        reserved3;
   uint32_t                                        reserved4;
   struct SI32_SARADC_A_SQ3210_Struct              SQ3210         ; // Base Address + 0x30
   uint32_t                                        reserved5;
   uint32_t                                        reserved6;
   uint32_t                                        reserved7;
   struct SI32_SARADC_A_CHAR32_Struct              CHAR32         ; // Base Address + 0x40
   volatile uint32_t                               CHAR32_SET;
   volatile uint32_t                               CHAR32_CLR;
   uint32_t                                        reserved8;
   struct SI32_SARADC_A_CHAR10_Struct              CHAR10         ; // Base Address + 0x50
   volatile uint32_t                               CHAR10_SET;
   volatile uint32_t                               CHAR10_CLR;
   uint32_t                                        reserved9;
   struct SI32_SARADC_A_DATA_Struct                DATA           ; // Base Address + 0x60
   uint32_t                                        reserved10;
   uint32_t                                        reserved11;
   uint32_t                                        reserved12;
   struct SI32_SARADC_A_WCLIMITS_Struct            WCLIMITS       ; // Base Address + 0x70
   uint32_t                                        reserved13;
   uint32_t                                        reserved14;
   uint32_t                                        reserved15;
   struct SI32_SARADC_A_ACC_Struct                 ACC            ; // Base Address + 0x80
   uint32_t                                        reserved16;
   uint32_t                                        reserved17;
   uint32_t                                        reserved18;
   struct SI32_SARADC_A_STATUS_Struct              STATUS         ; // Base Address + 0x90
   volatile uint32_t                               STATUS_SET;
   volatile uint32_t                               STATUS_CLR;
   uint32_t                                        reserved19;
   struct SI32_SARADC_A_FIFOSTATUS_Struct          FIFOSTATUS     ; // Base Address + 0xa0
   uint32_t                                        reserved20;
   uint32_t                                        reserved21;
   uint32_t                                        reserved22;
   uint32_t                                        reserved23[4];
} SI32_SARADC_A_Type;

#ifdef __cplusplus
}
#endif

#endif // __SI32_SARADC_A_REGISTERS_H__

//-eof--------------------------------------------------------------------------

